Autodesk.Revit.DB.LayoutRule
The LayoutRule object is a base object for all type of layout rules for
Beam System within the Autodesk Revit API.
Remarks: This class just used as the base class of those concrete LayoutRule classes.